Функция ПолучитьОписаниеHTTPСервиса() Экспорт
	
	Объекты = ПолучитьОбъектыHTTPСервиса();
	
	ТестовыйGETПараметры = Новый Массив;
	ТестовыйGETПараметры.Добавить(Swag_ФормированиеОписаний.ОписаниеПараметра("param1", "Какое-то описание параметра", "query", Истина));
	ТестовыйGETПараметры.Добавить(Swag_ФормированиеОписаний.ОписаниеПараметра("param2", "Ещё какой-то параметр", "query", , , , , 1));
	
	ТестовыйGET_MIME_Success = Новый Массив;
	ТестовыйGET_MIME_Success.Добавить(Swag_ФормированиеОписаний.ОписаниеТипаMIME("application/json", , Объекты[0].Имя));
	
	ТестовыйGETОтветы = Новый Массив;
	ТестовыйGETОтветы.Добавить(Swag_ФормированиеОписаний.ОписаниеОтвета(200, "Success", ТестовыйGET_MIME_Success));
	ТестовыйGETОтветы.Добавить(Swag_ФормированиеОписаний.ОписаниеОтвета(401, "Unauthorized"));
	
	///////////////////////////////////////////////////////////////////////
	ТестовыйPOSTТело_MIME = Новый Массив;
	ТестовыйPOSTТело_MIME.Добавить(Swag_ФормированиеОписаний.ОписаниеТипаMIME("application/json", , Объекты[2].Имя));
	
	ТестовыйPOSTТело = Swag_ФормированиеОписаний.ОписаниеТелаЗапроса(, ТестовыйPOSTТело_MIME);
	
	///////////////////////////////////////////////////////////////////////
	ОшибкаНетНужногоКодаОтветаGETОтветы = Новый Массив;
	ОшибкаНетНужногоКодаОтветаGETОтветы.Добавить(Swag_ФормированиеОписаний.ОписаниеОтвета(401, "Unauthorized"));
	
	///////////////////////////////////////////////////////////////////////
	ОшибкаНеЗаданТипMIMEGET_MIME_Success = Новый Массив;
	ОшибкаНеЗаданТипMIMEGET_MIME_Success.Добавить(Swag_ФормированиеОписаний.ОписаниеТипаMIME("application/json"));
	
	ОшибкаНеЗаданТипMIMEGETОтветы = Новый Массив;
	ОшибкаНеЗаданТипMIMEGETОтветы.Добавить(Swag_ФормированиеОписаний.ОписаниеОтвета(200, "Success", ОшибкаНеЗаданТипMIMEGET_MIME_Success));
	
	ТекстыДляМетодаТестовыйGET = Новый Структура("Описание, ДетальноеОписание",
		"Получение каких-то данных из 1С", "Гиперссылка: <a href=""http://example.com"">example.com</a>");
	
	Описание = Новый Массив;
	Описание.Добавить(Swag_ФормированиеОписаний.ОписаниеМетода("ТестовыйGET", ТекстыДляМетодаТестовыйGET, ТестовыйGETПараметры, ТестовыйGETОтветы));
	Описание.Добавить(Swag_ФормированиеОписаний.ОписаниеМетода("ТестовыйPOST", "Отправка каких-то данных в 1С", , , ТестовыйPOSTТело));
	Описание.Добавить(Swag_ФормированиеОписаний.ОписаниеМетода("ОшибкаНетОтветовGET", "Тест ошибки когда не заданы описания ответов", , Новый Массив));
	Описание.Добавить(Swag_ФормированиеОписаний.ОписаниеМетода("ОшибкаНетНужногоКодаОтветаGET", "Тест ошибки когда не определено описание конкретного кода ответа", , ОшибкаНетНужногоКодаОтветаGETОтветы));
	Описание.Добавить(Swag_ФормированиеОписаний.ОписаниеМетода("ОшибкаНеЗаданТипMIMEGET", "Тест ошибки когда в ответе не задан тип MIME", , ОшибкаНеЗаданТипMIMEGETОтветы));
	Описание.Добавить(Swag_ФормированиеОписаний.ОписаниеМетода("ОшибкаНекорректныйТипMIMEGET", "Тест ошибки когда в ответ с некорректным типом MIME", , ОшибкаНеЗаданТипMIMEGETОтветы));
	
	Возврат Описание;
	
КонецФункции

Функция ПолучитьОбъектыHTTPСервиса() Экспорт
	
	Реквизит2 = Swag_ФормированиеОписаний.ОписаниеРеквизитаОбъекта("test_property_2", "string");
	Реквизит2.Пример            = "ООО ""УУУ""";
	Реквизит2.МинимальнаяДлина  = 1;
	Реквизит2.МаксимальнаяДлина = 255;
	
	Реквизит3 = Swag_ФормированиеОписаний.ОписаниеРеквизитаОбъекта("test_property_3", "integer");
	Реквизит3.Пример           = 123.45;
	Реквизит3.Обязательный     = Истина;
	Реквизит3.Формат           = "int64";
	Реквизит3.Минимум          = 10;
	Реквизит3.Максимум         = 1000;
	Реквизит3.НеВключаяМинимум = Истина;
	Реквизит3.ПоУмолчанию      = 20;
	
	TestObjectМассивСвойств = Новый Массив;
	TestObjectМассивСвойств.Добавить(Swag_ФормированиеОписаний.ОписаниеРеквизитаОбъекта("test_property_1", "boolean"));
	TestObjectМассивСвойств.Добавить(Реквизит2);
	TestObjectМассивСвойств.Добавить(Реквизит3);
	TestObjectМассивСвойств.Добавить(Swag_ФормированиеОписаний.ОписаниеРеквизитаОбъекта("test_property_4", "array", "AnotherTestObject"));
	TestObjectМассивСвойств.Добавить(Swag_ФормированиеОписаний.ОписаниеРеквизитаОбъекта("test_property_5", "object", "AnotherTestObject"));
	
	TestPostObjectМассивСвойств = Новый Массив;
	TestPostObjectМассивСвойств.Добавить(Swag_ФормированиеОписаний.ОписаниеРеквизитаОбъекта("test_post_property", "string"));
	
	Объекты = Новый Массив;
	Объекты.Добавить(Swag_ФормированиеОписаний.ОписаниеОбъекта("TestObject", "object", TestObjectМассивСвойств, "test_property_1, test_property_2"));
	Объекты.Добавить(Swag_ФормированиеОписаний.ОписаниеОбъекта("AnotherTestObject", "object"));
	Объекты.Добавить(Swag_ФормированиеОписаний.ОписаниеОбъекта("TestPostObject", "object", TestPostObjectМассивСвойств));
	
	Возврат Объекты;
	
КонецФункции
