Функция ПолучитьОписаниеHTTPСервиса() Экспорт
	
	Объекты = ПолучитьОбъектыHTTPСервиса();
	
	ТестовыйGETПараметры = Новый Массив;
	ТестовыйGETПараметры.Добавить(Swag_ФормированиеОписаний.ОписаниеПараметра("param1", "Какое-то описание параметра", "query", Истина));
	ТестовыйGETПараметры.Добавить(Swag_ФормированиеОписаний.ОписаниеПараметра("param2", "Ещё какой-то параметр", "query"));
	
	ТестовыйGET_MIME_Success = Новый Массив;
	ТестовыйGET_MIME_Success.Добавить(Swag_ФормированиеОписаний.ОписаниеТипаMIME("application/json", , Объекты[0].Имя));
	
	ТестовыйGETОтветы = Новый Массив;
	ТестовыйGETОтветы.Добавить(Swag_ФормированиеОписаний.ОписаниеОтвета(200, "Success", ТестовыйGET_MIME_Success));
	ТестовыйGETОтветы.Добавить(Swag_ФормированиеОписаний.ОписаниеОтвета(401, "Unauthorized"));
	
	Описание = Новый Массив;
	Описание.Добавить(Swag_ФормированиеОписаний.ОписаниеМетода("ТестовыйGET", "Получение каких-то данных из 1С", ТестовыйGETПараметры, ТестовыйGETОтветы));
	Описание.Добавить(Swag_ФормированиеОписаний.ОписаниеМетода("ТестовыйPOST", "Отправка каких-то данных в 1С", ,));
	
	Возврат Описание;
	
КонецФункции

Функция ПолучитьОбъектыHTTPСервиса() Экспорт
	
	Объекты = Новый Массив;
	Объекты.Добавить(Swag_ФормированиеОписаний.ОписаниеОбъекта("TestObject", "object"));
	
	Возврат Объекты;
	
КонецФункции
