Функция ПолучитьОписаниеHTTPСервиса() Экспорт

	Объекты = ПолучитьОбъектыHTTPСервиса();
	
	ТестовыйGET_MIME_Success = Новый Массив;
	ТестовыйGET_MIME_Success.Добавить(Swag_ФормированиеОписаний.ОписаниеТипаMIME("application/json", , Объекты[0].Имя));
	
	ТестовыйGETОтветы = Новый Массив;
	ТестовыйGETОтветы.Добавить(Swag_ФормированиеОписаний.ОписаниеОтвета(200, "Success", ТестовыйGET_MIME_Success));
	ТестовыйGETОтветы.Добавить(Swag_ФормированиеОписаний.ОписаниеОтвета(401, "Unauthorized"));
	
	Описание = Новый Массив;
	Описание.Добавить(Swag_ФормированиеОписаний.ОписаниеМетода(
		"ТестовыйGET", "Получение других каких-то данных из 1С",, ТестовыйGETОтветы));
	
	Возврат Описание;
	
КонецФункции

Функция ПолучитьОбъектыHTTPСервиса() Экспорт

	TestObjectМассивСвойств = Новый Массив;
	TestObjectМассивСвойств.Добавить(Swag_ФормированиеОписаний.ОписаниеСвойстваОбъекта("name", , "string", , , , "Лист дерева"));
	TestObjectМассивСвойств.Добавить(Swag_ФормированиеОписаний.ОписаниеСвойстваОбъекта("children", , "array", , , "TestObject2"));
	
	Объекты = Новый Массив;
	Объекты.Добавить(Swag_ФормированиеОписаний.ОписаниеОбъекта(
		"TestObject2", "object", TestObjectМассивСвойств));
	
	Возврат Объекты;

КонецФункции
