Функция ПолучитьОписаниеHTTPСервиса() Экспорт

	Объекты = ПолучитьОбъектыHTTPСервиса();
	
	// Иерархический объект
	ТестовыйGET_MIME_Success = Новый Массив;
	ТестовыйGET_MIME_Success.Добавить(Swag_ФормированиеОписаний.ОписаниеТипаMIME("application/json", , Объекты[0].Имя));
	
	ТестовыйGETОтветы = Новый Массив;
	ТестовыйGETОтветы.Добавить(Swag_ФормированиеОписаний.ОписаниеОтвета(200, "Success", ТестовыйGET_MIME_Success));
	ТестовыйGETОтветы.Добавить(Swag_ФормированиеОписаний.ОписаниеОтвета(401, "Unauthorized"));

	// Составная схема
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Объекты[1].Имя); // CombineSchemaObject1
	МассивОбъектов.Добавить(Объекты[2].Имя); // CombineSchemaObject2
	
	CombineSchemaObject = Swag_ФормированиеОписаний.ОписаниеСоставнойСхемы("oneOf", МассивОбъектов);
	
	КомбинированнаяСхемаGET_MIME_Success = Новый Массив;
	КомбинированнаяСхемаGET_MIME_Success.Добавить(Swag_ФормированиеОписаний.ОписаниеТипаMIME("application/json", , CombineSchemaObject));
	
	КомбинированнаяСхемаGETОтветы = Новый Массив;
	КомбинированнаяСхемаGETОтветы.Добавить(Swag_ФормированиеОписаний.ОписаниеОтвета(200, "Success", КомбинированнаяСхемаGET_MIME_Success));
	КомбинированнаяСхемаGETОтветы.Добавить(Swag_ФормированиеОписаний.ОписаниеОтвета(401, "Unauthorized"));
	
	// Описание методов сервиса
	Описание = Новый Массив;
	Описание.Добавить(Swag_ФормированиеОписаний.ОписаниеМетода(
		"ТестовыйGET", "Получение других каких-то данных из 1С",, ТестовыйGETОтветы));
	Описание.Добавить(Swag_ФормированиеОписаний.ОписаниеМетода(
		"КомбинированнаяСхемаGET", "Получение данных из 1С с комбинированной схемой",, КомбинированнаяСхемаGETОтветы));
	
	Возврат Описание;
	
КонецФункции

Функция ПолучитьОбъектыHTTPСервиса() Экспорт

	// Иерархический объект
	РеквизитНаименование = Swag_ФормированиеОписаний.ОписаниеРеквизитаОбъекта("name", "string");
	РеквизитНаименование.Пример = "Лист дерева";
	
	TestObjectМассивСвойств = Новый Массив;
	TestObjectМассивСвойств.Добавить(РеквизитНаименование);
	TestObjectМассивСвойств.Добавить(Swag_ФормированиеОписаний.ОписаниеРеквизитаОбъекта("children", "array", "TestObject2"));
	
	// Составная схема
	РеквизитCombineSchemaObject1 = Swag_ФормированиеОписаний.ОписаниеРеквизитаОбъекта("property1", "boolean");
	РеквизитCombineSchemaObject1.Пример = "true";
	
	CombineSchemaObject1МассивСвойств = Новый Массив;
	CombineSchemaObject1МассивСвойств.Добавить(РеквизитCombineSchemaObject1);

	РеквизитCombineSchemaObject2 = Swag_ФормированиеОписаний.ОписаниеРеквизитаОбъекта("property2", "integer");
	РеквизитCombineSchemaObject2.Пример = 10;
	
	CombineSchemaObject2МассивСвойств = Новый Массив;
	CombineSchemaObject2МассивСвойств.Добавить(РеквизитCombineSchemaObject2);
	
	// Массив объектов
	Объекты = Новый Массив;
	Объекты.Добавить(Swag_ФормированиеОписаний.ОписаниеОбъекта(
		"TestObject2", "object", TestObjectМассивСвойств));
	Объекты.Добавить(Swag_ФормированиеОписаний.ОписаниеОбъекта(
		"CombineSchemaObject1", "object", CombineSchemaObject1МассивСвойств));
	Объекты.Добавить(Swag_ФормированиеОписаний.ОписаниеОбъекта(
		"CombineSchemaObject2", "object", CombineSchemaObject2МассивСвойств));
	
	Возврат Объекты;

КонецФункции
