////////////////////////////////////////////////////////////////////////////////
// БИЛЛИНГ
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Содержит общие настройки
// 
// Возвращаемое значение:
//  Стуктура - содержит свойства:
//		* НеОтображать - булево - Если истина, то API не будет отображаться в Swagger 
//		* Описание - строка - описание для чего предназначено данное API 
//
Функция ПолучитьОбщиеНастройки() Экспорт

	Настройки = Новый Структура;
	Настройки.Вставить("НеОтображать", Ложь);  // Если истина, то API не будет отображаться в Swagger
	Настройки.Вставить("Описание", "Сервис биллинга"); // Общее описание
	
	Возврат Настройки;

КонецФункции

// Возвращает основной массив описаний HTTP-Сервиса
// 
// Возвращаемое значение:
//  Массив - Список сформированного описания методов HTTP-сервиса. См. https://zerobig.github.io/swagger-1c/docs/getting-started/methods_func_style 
//
Функция ПолучитьОписаниеHTTPСервиса() Экспорт
	
	Методы = Swag_Описание
		// Биллинг
		.Метод("ВерсияGET") // Имя ручки 1С + Имя свойства (GET, POST и др)
			.ОписаниеМетода("Получение версии")
			.ДетальноеОписаниеМетода(НСтр("ru = 'Получение версии API.
                                           |Есть юнит-тест: Нет'"))  // Да, при наличии юнит-теста на yaxunit.
		.Ответ(200)
			.ОписаниеОтвета("Success")
				.ТипОтвета("application/json")
				.СхемаОтвета("БиллингВерсияGET")
				
		.Метод("СчетНаОплатуPOST")
			.ОписаниеМетода("Добавление счета на оплату")
			.ДетальноеОписаниеМетода(НСтр("ru = 'Расширенное добавление счета на оплату с данными тарифов и услуг.
	                                           |Есть юнит-тест: Нет'"))  // Да, при наличии юнит-теста на yaxunit.
			.ПараметрЗапроса("Версия") // Входящий параметр
				.ОписаниеПараметра("Версия интерфейса в числовом вид")
				.Обязательный()
			.Тело().ТипТела("application/json")
				.СхемаТела("БиллингСчетНаОплату")
			.Ответ(200)
				.ОписаниеОтвета("Success").ТипОтвета("application/json")
					.СхемаОтвета("БиллингСчетНаОплату_Ответ")
			.Ответ(422)
				.ОписаниеОтвета("Unprocessable Entity").ТипОтвета("application/json")
					.СхемаОтвета("errors422")
			
					
		.Метод("СчетНаОплатуPUT")
			.ОписаниеМетода("Изменение счета на оплату")
			.ДетальноеОписаниеМетода(НСтр("ru = 'Расширенное изменение счета на оплату с данными тарифов и услуг.
	                                           |Есть юнит-тест: Нет'"))  // Да, при наличии юнит-теста на yaxunit.
			.ПараметрЗапроса("Версия") // Входящий параметр
				.ОписаниеПараметра("Версия интерфейса в числовом вид")
				.Обязательный()
			.Тело().ТипТела("application/json")
				.СхемаТела("БиллингСчетНаОплату")
			.Ответ(200)
				.ОписаниеОтвета("Success").ТипОтвета("application/json")
					.СхемаОтвета("БиллингСчетНаОплату_Ответ")
			.Ответ(422)
				.ОписаниеОтвета("Unprocessable Entity").ТипОтвета("application/json")
					.СхемаОтвета("errors422")
			.Ответ(404)
				.ОписаниеОтвета("Not Found").ТипОтвета("application/json")
					.СхемаОтвета("errors404")

				
		.Сформировать()
		;		
		
	Возврат Методы;

КонецФункции

// Возвращает массив объектов описания HTTP-Сервиса
// 
// Возвращаемое значение:
//  Массив - Список сформированных объектов описания. См. https://zerobig.github.io/swagger-1c/docs/getting-started/objects_func_style
//
Функция ПолучитьОбъектыHTTPСервиса() Экспорт
	
	Объекты = Новый Массив;
	
	Объекты = Swag_Описание
		.Объект("БиллингВерсияGET") // Описание объекта
			.Свойство("version")
				.ОписаниеСвойства("Версия интерфейса из функции ОплатаСервиса.ВерсияИнтерфейса()")
				.ТипЗначения("integer")
				.Обязательный()
				.Пример(3)
	       	.Свойство("unit")
				.ОписаниеСвойства("КраткоеОписание. В 1С: НазваниеОбъекта.ИмяРеквизита")
				.ТипЗначения("string")
				.Пример("123")
						
			// Для примера варианты	
			.Свойство("test_property_1")
			    .Описание("Это описание для тестового свойства объекта")
			    .ТипЗначения("boolean")
			.Свойство("test_property_2")
        		.ТипЗначения("string")
		        .Пример("ООО ""УУУ""")
		        .МинимальнаяДлина(1)
		        .МаксимальнаяДлина(255)
			.Свойство("test_property_3")
		  		.ОписаниеСвойства("Массив строк")
		  		.ТипЗначения("array")
		  		.ТипМассива("string")
			.Свойство("test_property_4")
		  		.ОписаниеСвойства("Массив чисел")
		  		.ТипЗначения("array")
		  		.ТипМассива("integer")
			.Свойство("test_property_5")
				.ОписаниеСвойства("Перечисление значений: asc и desc")
				.ТипЗначения("string")
			    .ЗначениеПеречисления("asc")
			    .ЗначениеПеречисления("desc")
			.Свойство("test_property_6")
			    .ТипЗначения("integer")
			    .Пример(123.45)
			    .Обязательный()
			    .ФорматЗначения("int64")
			    .Минимум(10)
			    .Максимум(1000)
			    .НеВключаяМинимум()
				
		.Объект("БиллингСчетНаОплату") // Описание объекта Биллинг.СчетНаОплату
			.Свойство("id")
				.ОписаниеСвойства("Идентификатор счета на оплату")
				.Обязательный()
				.ТипЗначения("string")
				.МаксимальнаяДлина(36).МинимальнаяДлина(36)				
				.Пример("8f80d9d3-730a-4b8f-82a5-4ff52960691e")
			.Свойство("seller_id")
				.ОписаниеСвойства("Код абонента-продавца. В 1С: Организация.Код")
				.ТипЗначения("integer")
				.Пример("123")
			.Свойство("seller_name")
				.ОписаниеСвойства("Наименование продавца. В 1С: Организация.Наименование")
				.ТипЗначения("string")
				.Пример("ООО Ромашка") 
			.Свойство("client_id")
				.ОписаниеСвойства("Код покупателя. В 1С: Контрагент.Код")
				.ТипЗначения("integer")
				.Пример("123")
			.Свойство("client_name")
				.ОписаниеСвойства("Наименование покупателя. В 1С: Контрагент.Наименование")
				.ТипЗначения("string")
				.Пример("Иванов И.А.") 
			.Свойство("payment_link")
				.ОписаниеСвойства("Платежная ссылка")
				.ТипЗначения("string")
				.Пример("1112222вввв") 
             .Свойство("total_cost")
			 	.ОписаниеСвойства("Сумма полная")
			 	.ТипЗначения("number")
				.Минимум(0).НеВключаяМинимум()
				.Пример(12000.31)
			 .Свойство("system")
			  	.ОписаниеСвойства("Система. В 1С: НазваниеОбъекта.ИмяРеквизита")
			  	.ТипЗначения("string")
			  	.Пример("123") 				  
				
			 .Свойство("services")
				.ОписаниеСвойства("Сервис массив")
				.ТипЗначения("array")
				.Схема("БиллингСчетНаОплату_services")
				
			 .Свойство("services_object")
				.ОписаниеСвойства("Сервис объект")
				.ТипЗначения("object")
				.Схема("БиллингСчетНаОплату_services_object")
				
		.Объект("БиллингСчетНаОплату_services_object")  // дочерний объект свойства ИмяСвойства
			.Свойство("Идентификатор")
				.ОписаниеСвойства("Идентификатор. В 1С: НазваниеОбъекта.Идентификатор")
				.ТипЗначения("string")
				.МаксимальнаяДлина(36).МинимальнаяДлина(36)				
				.Пример("8f80d9d3-730a-4b8f-82a5-4ff52960691e")
				
		.Объект("БиллингСчетНаОплату_services")  // дочерний объект свойства БиллингСчетНаОплату
			.Свойство("service_id")
				.ОписаниеСвойства("Идентификатор услуги. В 1С: Услуги.ГУИД")
				.ТипЗначения("string")
				.МаксимальнаяДлина(36).МинимальнаяДлина(36)				
				.Пример("8f80d9d3-730a-4b8f-82a5-4ff52960691e")
				
				
		.Объект("БиллингСчетНаОплату_Ответ") 
			.ОбязательныеПоля("response, message")
			.Свойство("response")
				.ОписаниеСвойства("Код ответа")
				.ТипЗначения("integer")
				.Пример(200) 
			.Свойство("error")
				.ОписаниеСвойства("Есть ошибки")
				.ТипЗначения("boolean")
				.Пример(Истина) 
			.Свойство("message")
				.ОписаниеСвойства("Результат обработки")
				.ТипЗначения("string")
				.Пример("Данные успешно обработаны") 
				
		
		.Сформировать()
		;
		
 	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Объекты, Swag_ОбщиеОписанияПереопределяемый.ОбъектErrors422());
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Объекты, Swag_ОбщиеОписанияПереопределяемый.ОбъектErrors404());

	Возврат Объекты;		

КонецФункции

#КонецОбласти