////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ОБЩИХ ОПИСАНИЙ
// Например: ОбъектErrors422() - вариант описания ошибки 422
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПримерыЗаполнения

// Возвращает описание для ошибки 422 Unprocessable Entity 
// 
// Возвращаемое значение:
//  Массив Из Структура - см. Swag_Описание.Объект()
//
Функция ОбъектErrors422() Экспорт
	
	Объекты = Новый Массив;
	Объекты = Swag_Описание
	  	.Объект("errors422")
		    .ОбязательныеПоля("errors")
			.Свойство("errors")
				.Описание("errors")
				.ТипЗначения("array")
				.Схема("ErrorsDetails422") 
			.Свойство("meta")
				.Описание("Meta")
				.ТипЗначения("object")
			.Свойство("data")
				.Описание("Data")
				.ТипЗначения("object")
		.Объект("ErrorsDetails422")  // дочерний объект свойства errors
		    .ОбязательныеПоля("code, detail")
			.Свойство("id")
				.Описание("Числовой код ошибки")
				.ТипЗначения("integer")
				.Пример(422) 
			.Свойство("code")
				.Описание("Символьный код ошибки (на латинице без пробелов)")
				.ТипЗначения("string")
				.Пример("ErrorHard") 
			.Свойство("source")
				.Описание("Источник ошибки")
				.ТипЗначения("object")
			.Свойство("title")
				.Описание("Заголовок ошибки")
				.ТипЗначения("string")
				.Пример("123") 
			.Свойство("detail")
				.Описание("Текстовое описание ошибки")
				.ТипЗначения("string")
				.Пример("Необработан запрос") 
		.Сформировать()
		;
	
	Возврат Объекты;

КонецФункции

// Возвращает описание для ошибки 404 Not Found
// 
// Возвращаемое значение:
//  Массив Из Структура - см. Swag_Описание.Объект()
//
Функция ОбъектErrors404() Экспорт
	
	Объекты = Новый Массив;
	Объекты = Swag_Описание
	  	.Объект("errors404")
		    .ОбязательныеПоля("errors")
			.Свойство("errors")
				.Описание("errors")
				.ТипЗначения("array")
				.Схема("ErrorsDetails404") 
			.Свойство("meta")
				.Описание("Meta")
				.ТипЗначения("object")
			.Свойство("data")
				.Описание("Data")
				.ТипЗначения("object")
		.Объект("ErrorsDetails404")  // дочерний объект свойства errors
		    .ОбязательныеПоля("code, detail")
			.Свойство("id")
				.Описание("Числовой код ошибки")
				.ТипЗначения("integer")
				.Пример(404) 
			.Свойство("code")
				.Описание("Символьный код ошибки (на латинице без пробелов)")
				.ТипЗначения("string")
				.Пример("item_not_found") 
			.Свойство("source")
				.Описание("Источник ошибки")
				.ТипЗначения("object")
			.Свойство("title")
				.Описание("Заголовок ошибки")
				.ТипЗначения("string")
				.Пример("123") 
			.Свойство("detail")
				.Описание("Текстовое описание ошибки")
				.ТипЗначения("string")
				.Пример("Не найден объект") 
		.Сформировать()
		;
	
	Возврат Объекты;

КонецФункции

// Возвращает описание для ошибки 400 Bad Request 
// 
// Возвращаемое значение:
//  Массив Из Структура - см. Swag_Описание.Объект()
//
Функция ОбъектErrors400() Экспорт
	
	Объекты = Новый Массив;
	Объекты = Swag_Описание
	  	.Объект("errors400")
		    .ОбязательныеПоля("errors")
			.Свойство("errors")
				.Описание("errors")
				.ТипЗначения("array")
				.Схема("ErrorsDetails400") 
			.Свойство("meta")
				.Описание("Meta")
				.ТипЗначения("object")
			.Свойство("data")
				.Описание("Data")
				.ТипЗначения("object")
		.Объект("ErrorsDetails400")  // дочерний объект свойства errors
		    .ОбязательныеПоля("code, detail")
			.Свойство("id")
				.Описание("Числовой код ошибки")
				.ТипЗначения("integer")
				.Пример(400) 
			.Свойство("code")
				.Описание("Символьный код ошибки (на латинице без пробелов)")
				.ТипЗначения("string")
				.Пример("ErrorHard") 
			.Свойство("source")
				.Описание("Источник ошибки")
				.ТипЗначения("object")
			.Свойство("title")
				.Описание("Заголовок ошибки")
				.ТипЗначения("string")
				.Пример("123") 
			.Свойство("detail")
				.Описание("Текстовое описание ошибки")
				.ТипЗначения("string")
				.Пример("некорректный запрос/ошибки при обработке") 
		.Сформировать()
		;
	
	Возврат Объекты;

КонецФункции

#КонецОбласти

#КонецОбласти
