
#Область ОбъявлениеТестов

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТестовыйНабор("Swagger: Базовые")
			.ДобавитьТест("ПолучитьSwaggerФайл")
	;

КонецПроцедуры

#КонецОбласти

#Область События



#КонецОбласти

#Область Тесты

Процедура ПолучитьSwaggerФайл() Экспорт
	
	Запрос = ЮТест.Данные().HTTPСервисЗапрос();
	Запрос.ПараметрыURL.Вставить("File", "swagger.json");
	
	Результат = Swag_Запросы.ПолучитьSwaggerFileGET(Запрос);
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку());
	// Читаю в соответствие т.к. у swagger.json названия полей со слэшами
	СоответствиеОтвета = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	ЮТест.ОжидаетЧто(СоответствиеОтвета)
		.ИмеетТип("Соответствие")
	;
	
КонецПроцедуры

#КонецОбласти
