Функция ПолучитьОписаниеHTTPСервиса() Экспорт
	
	МассивОписанийМетодов = Swag_Описание
		.Метод("ТестовыйGET")
			.ОписаниеМетода("Получение данных из 1С")
			.ПараметрURL("Версия")
				.ОписаниеПараметра("Версия метода")
				.ЗначениеПеречисления("1.0")
				.ЗначениеПеречисления("2.0")
			.Ответ(200)
				.ОписаниеОтвета("Success")
		.Сформировать()
	;

	Возврат МассивОписанийМетодов;

КонецФункции

Функция ПолучитьОбъектыHTTPСервиса() Экспорт

	Объекты = Новый Массив;
	
	Возврат Объекты;

КонецФункции
