#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивАдресов = Swag_НастройкиSwaggerПереопределяемый.БазовыеАдресаHttpСерверов1С();
	Элементы.БазовыйURL.СписокВыбора.ЗагрузитьЗначения(МассивАдресов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДекорацияСсылкаНажатие(Элемент)
	ЗапуститьПриложение("https://editor-next.swagger.io/"); 
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекстSwagger(Команда)
	ПолучитьТекстSwaggerНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьТекстSwaggerНаСервере()
	
	ТекстJSON = "";
	Если Не ЗначениеЗаполнено(БазовыйURL) Тогда
		СтрокаСообщения = НСтр("ru = 'Не задан базовый URL'");
		ОбщегоНазначения.СообщитьПользователю(СтрокаСообщения);
		Возврат;
	КонецЕсли;
	ТекстJSON = Swag_Запросы.СформироватьБазовыйSwaggerJson(БазовыйURL);
	
КонецПроцедуры

#КонецОбласти