// Возвращает структуру с описанием параметра HTTP сервиса
//
// Параметры:
//  Имя - Строка
//  ОписаниеПараметра - Строка
//  Тип - Строка
//  Обязательный - Булево - признак того что это обязательный параметр
//  Устарел - Булево - признак deprecated
Функция ОписаниеПараметра(Имя, ОписаниеПараметра, Тип, Обязательный = Ложь, Устарел = Ложь) Экспорт
	
	Возврат Новый Структура("Имя, Описание, Тип, Обязательный, Устарел",
		Имя, ОписаниеПараметра, Тип, Обязательный, Устарел)
	
КонецФункции

// Возвращает структуру с описанием ответа HTTP сервиса
//
// Параметры:
//  Код - Число - код ответа HTTP (200, 201, 401, 404 и т.д.)
//  ОписаниеОтвета - Строка - описание ответа как он будет выглядеть в документации
//  МассивТиповMIME - Массив - массив структур получаемых через функцию ОписаниеТипаMIME
Функция ОписаниеОтвета(Код, ОписаниеОтвета, МассивТиповMIME = Неопределено) Экспорт
	
	Возврат Новый Структура("Код, Описание, МассивТиповMIME", Код, ОписаниеОтвета, МассивТиповMIME)
	
КонецФункции

// Возвращает структуру с описанием типа MIME ответа
//
// Параметры:
// Заголовок - Строка - описание типа MIME (application/json, application/json-patch+json и т.д.)
// Тип - Строка
// Схема - Строка - наименование объекта как он задан через функцию ОписаниеОбъекта
Функция ОписаниеТипаMIME(Заголовок, Тип = Неопределено, Схема = Неопределено) Экспорт
	
	Возврат Новый Структура("Заголовок, Тип, Схема", Заголовок, Тип,
		?(ТипЗнч(Схема) = Тип("Строка"), "#/components/schemas/" + Схема, ""));
	
КонецФункции

// Возвращает структуру с описанием метода HTTP сервиса
//
// Параметры:
//  Метод - Строка - наименование метода как он описан в конфигураторе. Строится по принципу <Имя шаблона URL><Имя метода>
//  ОписаниеМетода - Строка - описание метода как оно будет выглядеть в документации
//  Параметры - Массив
//  Ответы - Массив
Функция ОписаниеМетода(Метод, ОписаниеМетода, Параметры, Ответы) Экспорт
	
	Возврат Новый Структура("Имя, Описание, Параметры, Ответы", Метод, ОписаниеМетода, Параметры, Ответы)
	
КонецФункции

// Возвращает структуру с описанием объекта (модели)
//
// Параметры:
//  Имя - Строка - наименование объекта (модели)
//  Тип - Строка
//  МассивСвойств - Массив - свойства объекта, которые, в свою очередь, могут включать другие объекты и т.д.
Функция ОписаниеОбъекта(Имя, Тип, МассивСвойств = Неопределено) Экспорт
	
	Возврат Новый Структура("Имя, Тип, МассивСвойств", Имя, Тип, МассивСвойств);
	
КонецФункции