Функция ОписаниеПараметра(Имя, ОписаниеПараметра, Тип, Обязательный = Ложь, Устарел = Ложь, ПринимаютсяПустыеЗначения = Ложь) Экспорт
	
	Возврат Новый Структура("Имя, Описание, Тип, Обязательный, Устарел, ПринимаютсяПустыеЗначения",
		Имя, ОписаниеПараметра, Тип, Обязательный, Устарел, ПринимаютсяПустыеЗначения)
	
КонецФункции

Функция ОписаниеОтвета(Код, ОписаниеОтвета, МассивТиповMIME = Неопределено) Экспорт
	
	Возврат Новый Структура("Код, Описание, МассивТиповMIME", Код, ОписаниеОтвета, МассивТиповMIME)
	
КонецФункции

Функция ОписаниеТипаMIME(Заголовок, Тип = Неопределено, Схема = Неопределено) Экспорт
	
	Возврат Новый Структура("Заголовок, Тип, Схема", Заголовок, Тип,
		?(ТипЗнч(Схема) = Тип("Строка"), "#/components/schemas/" + Схема, ""));
	
КонецФункции

Функция ОписаниеМетода(Метод, ОписаниеМетода, Параметры, Ответы) Экспорт
	
	Возврат Новый Структура("Имя, Описание, Параметры, Ответы", Метод, ОписаниеМетода, Параметры, Ответы)
	
КонецФункции

Функция ОписаниеОбъекта(Имя, Тип, МассивСвойств = Неопределено) Экспорт
	
	Возврат Новый Структура("Имя, Тип, МассивСвойств", Имя, Тип, МассивСвойств);
	
КонецФункции