Функция ОписаниеПараметра(Имя, ОписаниеПараметра, Тип, Обязательный = Ложь, Устарел = Ложь, ПринимаютсяПустыеЗначения = Ложь) Экспорт
	
	Возврат Новый Структура("Имя, Описание, Тип, Обязательный, Устарел, ПринимаютсяПустыеЗначения",
		Имя, ОписаниеПараметра, Тип, Обязательный, Устарел, ПринимаютсяПустыеЗначения)
	
КонецФункции

Функция ОписаниеОтвета(Код, ОписаниеОтвета) Экспорт
	
	Возврат Новый Структура("Код, Описание", Код, ОписаниеОтвета)
	
КонецФункции

Функция ОписаниеМетода(Метод, ОписаниеМетода, Параметры, Ответы) Экспорт
	
	Возврат Новый Структура("Имя, Описание, Параметры, Ответы", Метод, ОписаниеМетода, Параметры, Ответы)
	
КонецФункции