////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ БАЗОВЫХ НАСТРОЕК SWAGGER
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает массив базовых адресов http-сервисов 1С
// 
// Возвращаемое значение:
//  Массив Из Строка - список адресов 
//
Функция БазовыеАдресаHttpСерверов1С() Экспорт

	Адреса = Новый Массив;
	
	// Пример
	Адреса.Добавить("https://test.ru/erp_test_PreProd/hs");  // Предпрод
	Адреса.Добавить("https://test.ru/ERP_Prod/hs");    // Прод
	
	Возврат Адреса;

КонецФункции

#КонецОбласти
