Функция ПолучитьОписаниеHTTPСервиса() Экспорт
	
	Объекты = ПолучитьОбъектыHTTPСервиса();
	
	МассивОписанийМетодов = Swag_Описание
		.Метод("ТестовыйGET")
			.ОписаниеМетода("Получение каких-то данных из 1С")
			.ПараметрЗапроса("param1")
				.ОписаниеПараметра("Какое-то описание параметра")
				.Обязательный()
			.ПараметрЗапроса("param2")
				.ОписаниеПараметра("Ещё какой-то параметр")
				.МинимальнаяДлина(1)
			.ПараметрЗапроса("param3")
				.ОписаниеПараметра("Параметр для теста перечисления")
				.ЗначениеПеречисления(1)
				.ЗначениеПеречисления(2)
			.Ответ(200)
				.ОписаниеОтвета("Success")
				.ТипОтвета("application/json")
					.СхемаОтвета(Объекты[0].Имя)
			.Ответ(401)
				.ОписаниеОтвета("Unauthorized")
		//
		.Метод("ТестовыйPOST")
			.ОписаниеМетода("Отправка каких-то данных в 1С")
			.Тело()
				.ТипТела("application/json")
					.СхемаТела(Объекты[2].Имя)
		//
		.Метод("ОшибкаНетОтветовGET")
			.ОписаниеМетода("Тест ошибки когда не заданы описания ответов")
		//
		.Метод("ОшибкаНетНужногоКодаОтветаGET")
			.ОписаниеМетода("Тест ошибки когда не определено описание конкретного кода ответа")
			.Ответ(401)
				.ОписаниеОтвета("Unauthorized")
		//
		.Метод("ОшибкаНеЗаданТипMIMEGET")
			.ОписаниеМетода("Тест ошибки когда в ответе не задан тип MIME")
			.Ответ(200)
				.ОписаниеОтвета("Success")
				.ТипОтвета("application/json")
		//
		.Метод("ОшибкаНекорректныйТипMIMEGET")
			.ОписаниеМетода("Тест ошибки когда в ответ с некорректным типом MIME")
			.Ответ(200)
				.ОписаниеОтвета("Success")
				.ТипОтвета("application/json")
		//
		.Метод("КомбинированнаяСхемаGET")
			.ОписаниеМетода("Получение данных из 1С с комбинированной схемой")
			.Ответ(200)
				.ОписаниеОтвета("Success")
				.ТипОтвета("application/json")
					.ОбъединениеСхемОтвета("oneOf")
						.СхемаОтвета(Объекты[3].Имя)
						.СхемаОтвета(Объекты[4].Имя)
		.Метод("КомбинированнаяСхемаPOST")
			.ОписаниеМетода("Отправка данных в 1С с комбинированной схемой")
			.Тело()
				.ТипТела("application/json")
					.ОбъединениеСхемТела("oneOf")
						.СхемаТела(Объекты[3].Имя)
						.СхемаТела(Объекты[4].Имя)
		.Сформировать()
	;
	
	Возврат МассивОписанийМетодов;
	
КонецФункции

Функция ПолучитьОбъектыHTTPСервиса() Экспорт
	
	Объекты = Swag_Описание
		.Объект("TestObject3")
			.ОбязательныеПоля("test_property_1, test_property_2")
			.Свойство("test_property_1")
				.ОписаниеСвойства("Это описание для тестового свойства объекта")
				.ТипЗначения("boolean")
			.Свойство("test_property_2")
				.ТипЗначения("string")
				.Пример("ООО ""УУУ""")
				.МинимальнаяДлина(1)
				.МаксимальнаяДлина(255)
			.Свойство("test_property_3")
				.ТипЗначения("integer")
				.Пример(123.45)
				.Обязательный()
				.ФорматЗначения("int64")
				.Минимум(10)
				.Максимум(1000)
				.НеВключаяМинимум()
				.ПоУмолчанию(20)
			.Свойство("test_property_4")
				.ОписаниеСвойства("Это описание для массива")
				.ТипЗначения("array")
				.Схема("AnotherTestObject3")
			.Свойство("test_property_5")
				.ОписаниеСвойства("Это описание для другого тестового свойства объекта")
				.ТипЗначения("string")
				.ЗначениеПеречисления("asc")
				.ЗначениеПеречисления("desc")
			.Свойство("test_property_6")
				.ОписаниеСвойства("Это описание для третьего тестового свойства объекта")
				.ТипЗначения("object")
				.Схема("AnotherTestObject3")
		//
		.Объект("AnotherTestObject3")
			.ОписаниеОбъекта("Это описание для другого тестового объекта")
			.Свойство("another_test_property")
				.ОписаниеСвойства("Это описание для свойства")
				.ТипЗначения("string")
		//
		.Объект("TestPostObject3")
			.Свойство("test_post_property")
				.ТипЗначения("string")
		//
		.Объект("CombineSchemaObject1_3")
			.Свойство("property1")
				.ТипЗначения("boolean")
				.Пример("true")
		//
		.Объект("CombineSchemaObject2_3")
			.Свойство("property2")
				.ТипЗначения("integer")
				.Пример(10)
		.Сформировать()
	;
	
	Возврат Объекты;
		
КонецФункции
