
Функция ТестовыйGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаОтвета = "Получены параметры:
	|	param1: " + Запрос["ПараметрыЗапроса"].Получить("param1") + "
	|	parma2: " + Запрос["ПараметрыЗапроса"].Получить("param2");
	Ответ.Заголовки.Вставить("Content-Type", "text/plain; charset=UTF-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
КонецФункции

Функция ТестовыйPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции
