Функция ТестовыйGET(Запрос)
	
	РезультатПроверкиПараметров = Swag_ОбработкаHTTP.ПроверитьПараметры("SwagTest_Тестовый_HTTPСервис", "ТестовыйGET", Запрос);
	Если Не ПустаяСтрока(РезультатПроверкиПараметров) Тогда
		Возврат Swag_ОбработкаHTTP.ПолучитьОтветОшибки(РезультатПроверкиПараметров, Истина);
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаОтвета = "{
	|	""param1"": """ + Запрос["ПараметрыЗапроса"].Получить("param1") + """,
	|	""param2"": """ + Запрос["ПараметрыЗапроса"].Получить("param2") + """
	|}";
	Ответ.Заголовки.Вставить("Content-Type", "application/json");
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Возврат Swag_ОбработкаHTTP.ПроверитьОтвет("SwagTest_Тестовый_HTTPСервис", "ТестовыйGET", Ответ);
	
КонецФункции

Функция ТестовыйPOST(Запрос)
	
	РезультатПроверкиПараметров = Swag_ОбработкаHTTP.ПроверитьПараметры("SwagTest_Тестовый_HTTPСервис", "ТестовыйPOST", Запрос);
	Если Не ПустаяСтрока(РезультатПроверкиПараметров) Тогда
		Возврат Swag_ОбработкаHTTP.ПолучитьОтветОшибки(РезультатПроверкиПараметров, Истина);
	КонецЕсли;
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции

Функция ОшибкаНетОписанияGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Swag_ОбработкаHTTP.ПроверитьОтвет("SwagTest_Тестовый_HTTPСервис", "ОшибкаНетОписанияGET", Ответ);
КонецФункции

Функция ОшибкаНетОтветовGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Swag_ОбработкаHTTP.ПроверитьОтвет("SwagTest_Тестовый_HTTPСервис", "ОшибкаНетОтветовGET", Ответ);
КонецФункции

Функция ОшибкаНетНужногоКодаОтветаGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Swag_ОбработкаHTTP.ПроверитьОтвет("SwagTest_Тестовый_HTTPСервис", "ОшибкаНетНужногоКодаОтветаGET", Ответ);
КонецФункции

Функция ОшибкаНеЗаданТипMIMEGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Swag_ОбработкаHTTP.ПроверитьОтвет("SwagTest_Тестовый_HTTPСервис", "ОшибкаНеЗаданТипMIMEGET", Ответ);
КонецФункции

Функция ОшибкаНекорректныйТипMIMEGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type", "text/plain");
	Возврат Swag_ОбработкаHTTP.ПроверитьОтвет("SwagTest_Тестовый_HTTPСервис", "ОшибкаНекорректныйТипMIMEGET", Ответ);
КонецФункции
